// Напишите метод, который принимает на вход число и выдаёт сумму цифр в числе
using static SumNumber;

int number = ConsoleInput("Введите натуральное число :");
Console.Write(Sum(number));